Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བྱེད་པ་དང་། བཀུར་སྟིར་བྱེད་པ་དང་། བསྟི་སྟང་དུ་བྱེད་པ་དང་། མཆོད་པར་བྱེད་པ་དེ་དག་ཚེ་འདི་ཉིད་དང་། ཚེ་རབས་ཕྱི་མ་ལ་ཡོན་ཏན་དེ་དག་ཀྱང་། རྣམ་པ་དེ་བཞིན་དུ་འཐོབ་པར་ངས་བཤད་དོ། །བརྒྱ་བྱིན་གྱིས་གསོལ་བ། བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་ཅིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དང་མ་བྲལ་བར་བགྱིད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བྲིས་ཤིང་། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བགྱིད་པ་དང་། བཀུར་སྟིར་བགྱིད་པ་དང་། བསྟི་སྟང་དུ་བགྱིད་པ་དང་། མཆོད་པར་བགྱིད་པ་དེ་ལ་ནི། བདག་གིས་ཀྱང་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་བསྲུང་བ་དང་། བསྐྱབ་པ་དང་། བསྐྱང་བ་བགྱིའོ།
en: II-III: 81} Śakra then said, “Blessed Lord, I will always uninterruptedly guard, shelter, and nurture those noble sons or noble daughters who take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom, never separating from the mind set on all-aspect omniscience, and who commit this perfection of wisdom to writing, and then serve, respect, honor, and worship it with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, ribbons, and various musical sounds.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི། ཁ་ཏོན་དུ་བྱེད་པའི་ཚེ། ལྷའི་བུ་བརྒྱ་སྟོང་མང་པོ་དགའ་བའི་ཡིད་ཀྱིས་ཆོས་ཉན་པའི་ཕྱིར་འོངས་ཏེ།
en: Kauśika,” replied the Blessed One, “when noble sons or noble daughters chant this perfection of wisdom, many hundred thousands of gods will delightedly arrive to hear the Dharma.

source: རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་ལྡན་པའི་ཆོས་སྟོན་པའི་ཚེ་ཡང་། ལྷའི་བུ་དེ་དག་སྤོབས་པ་ཉེ་བར་བསྒྲུབ་པར་སེམས་སོ།
en: Indeed, when those noble sons or noble daughters teach the Dharma endowed with the perfection of wisdom, the gods will think that they are drawing upon inspired speech.

source: །ཆོས་སྨྲས་པ་དེ་དག་སྨྲ་བ་སྙོམ་པར་གྱུར་ན་ཡང་། ལྷའི་བུ་དེ་དག་ཆོས་ཀྱི་རིམ་གྲོ་དེ་ཉིད་ཀྱི་སྤོབས་པ་ཉེ་བར་བསྒྲུབ་པར་སེམས་ཏེ། ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་། བྲིས་ཤིང་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། བདུག་སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་
en: Even when those [noble sons or noble daughters] who profess the Dharma speak quietly, the gods will think that they are drawing upon inspired speech that is in the service of the Dharma.

source: བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བྱེད་པ་དང་། བཀུར་སྟིར་བྱེད་པ་དང་། བསྟི་སྟང་དུ་བྱེད་པ་དང་། མཆོད་པར་བྱེད་པ་དེ་དག་གིས་ཚེ་འདིའི་ཡོན་ཏན་འདི་ཡང་ཡོངས་སུ་ཟིན་པར་འགྱུར་རོ།
en: Kauśika, those noble sons or noble daughters who take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom, and who commit it to writing, and then serve, respect, honor, and worship it with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, ribbons, and various musical sounds, will indeed acquire such qualities that pertain to the present life. “

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་འཁོར་བཞི་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོན་པའི་ཚེ། ལ་ལ་ཞིག་བདག་ལ་གླན་ཀ་ཚོལ་ཞིང་གླགས་ལྟ་བར་གྱུར་དུ་འོང་ངོ་། །ཞེས་བྱ་བར་ཞུམ་པ་མེད་པར་འགྱུར་རོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Moreover, Kauśika, when those noble sons or noble daughters teach the perfection of wisdom to the four assemblies, they will not be discouraged lest someone might seek to censure them and look for an opportunity to intrude [and cause harm].

source: དེ་ནི་འདི་ལྟར་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་བསྲུང་བ་དང་། བསྐྱབ་པ་དང་། བསྐྱང་བ་བྱེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་ནི། འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པ་དང་། ཟག་པ་དང་བཅས་པ་དང་། ཟག་པ་མེད་པ་དང་། ཐུན་མོང་དང་། ཐུན་མོང་མ་ཡིན་པ་དང་། དགེ་བ་དང་། མི་དགེ་བ་དང་། འདུས་བྱས་དང་།
en: If you ask why, it is because this same perfection of wisdom will guard, shelter, and nurture those noble sons or noble daughters.

source: འདུས་མ་བྱས་དང་། ཉན་ཐོས་ཀྱི་ཆོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱང་ཐ་མི་དད་དོ།
en: If you ask why, it is because in this perfection of wisdom all phenomena—mundane and supramundane, contaminated and uncontaminated, common and uncommon, virtuous and nonvirtuous, conditioned and unconditioned—as well as the attributes of the śrāvakas, the attributes of the pratyekabuddhas, the attributes of the bodhisattvas, and the attributes of the buddhas, are indeed undifferentiated.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་འདི་ནི་དགེ་བའི་ཆོས་ཐམས་ཅད་ཀྱི་གཏེར་ཡིན་ལ།
en: If you ask why, it is because this is the treasure comprising all virtuous attributes. {Ki.

source: རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་དེ་ཡང་། ནང་སྟོང་པ་ཉིད་ལ་གནས། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་གནས་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གླགས་ལྟ་བ་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་།
en: II-III: 82} Since those noble sons or noble daughters also dwell utterly in the emptiness of internal phenomena, and dwell utterly in [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, they do not at all observe anyone seeking to censure the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གང་གླགས་ལྟ་བ་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གང་གླགས་ལྟ་བར་བྱ་བ་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: Nor do they observe any censure of the perfection of wisdom, nor do they observe anything that could be censured in the perfection of wisdom.

source: དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་བཟུང་བའི་ཕྱིར། རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་དེ་ལ་སུས་ཀྱང་གླགས་ལྟ་བ་མེད་དོ།
en: Because they have been favored by the perfection of wisdom there is no one at all who can seek to censure those noble sons or noble daughters. “

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་ཅིང་འཆང་བ་དང་། ཀློག་ཅིང་ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དེའི་སེམས་ཞུམ་པར་མི་འགྱུར།
en: Moreover, Kauśika, the minds of those noble sons or noble daughters who take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom will not cower.

source: ཡོངས་སུ་ཞུམ་པར་མི་འགྱུར། འཇིགས་པར་མི་འགྱུར།
en: They will not be intimidated. They will not be afraid.

source: སྡང་བར་མི་འགྱུར།
en: They will not be terrified.

source: སྐྲག་པར་མི་འགྱུར་རོ།
en: They will not be fearful.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་ལ་སུས་ཀྱང་གླགས་ལྟ་བ་མེད་དོ།
en: If you ask why, it is because there is no one at all who can seek to censure those noble sons or noble daughters. “

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་ཅིང་འཆང་བ་དང་། ཀློག་ཅིང་ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དེའི་སེམས་ཞུམ་པར་མི་འགྱུར།
en: Moreover, Kauśika, the minds of those noble sons or noble daughters who take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom will not cower.

source: སྐྲག་པར་མི་འགྱུར་རོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: They will not be fearful.

source: དེ་ནི་འདི་ལྟར་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་གང་ཞུམ་པར་འགྱུར་བ་འམ། ཡོངས་སུ་ཞུམ་པར་འགྱུར་བའམ། འཇིགས་པར་འགྱུར་བའམ། སྐྲག་པར་འགྱུར་བ་དེ་ལྟ་བུའི་དངོས་པོ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བའི་ཕྱིར་ཏེ། ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་། བྲིས་ཤིང་དེ་ལ་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་།
en: If you ask why, it is because those noble sons or noble daughters do not consider that there is any entity that would cause them to cower, to be intimidated, to be afraid, or to be fearful.

source: སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བྱེད་པ་དང་། བཀུར་སྟིར་བྱེད་པ་དང་། བསྟི་སྟང་དུ་བྱེད་པ་དང་། མཆོད་པར་བྱེད་པ་དེ་དག་གིས་ཚེ་འདིའི་ཡོན་ཏན་འདི་དག་ཡོངས་སུ་ཟིན་པར་འགྱུར་རོ། །ཀཽ་ཤི་ཀ་གཞན་ཡང་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་། བྲིས་ཤིང་དེ་ལ་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་།
en: Kauśika, those noble sons or noble daughters who take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom, and who commit it to writing, and then serve, respect, honor, and worship it with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, ribbons, and various musical sounds, will acquire such qualities that pertain to this life. “

source: སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བྱེད་པ་དང་། བཀུར་སྟིར་བྱེད་པ་དང་། བསྟི་སྟང་དུ་བྱེད་པ་དང་། མཆོད་པར་བྱེད་པ་དེ་ནི་ཕ་དང་མ་དང་། གཉེན་བཤེས་དང་། རྒྱལ་པོ་དང་། བློན་པོ་དང་།
en: Moreover, Kauśika, any noble sons or noble daughters who take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom, and who commit it to writing, and then serve, respect, honor, and worship it with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, ribbons, and various musical sounds, will be kept in mind by their parents, friends, kings, ministers, virtuous ascetics, and brāhmin priests.

source: དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དག་གིས་དགོངས་པར་བྱ་བ་ཡིན། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་ཅིག་བཞུགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། རང་སངས་རྒྱས་དང་། དགྲ་བཅོམ་པ་དང་། སློབ་པ་དང་། མི་སློབ་པ་དང་། མི་སློབ་པ་ཐམས་ཅད་ཀྱིས་ཀྱང་དབེན་ཅིང་ཡིད་དུ་འོང་བར་བྱ་བ་ཡིན། འཇིག་རྟེན་ལྷ་དང་བཅས་པ། བདུད་དང་བཅས་པ།
en: They will also be singled out and held dear by all the lord buddhas who are alive and present in the world systems of the ten directions, as well as by bodhisattva great beings, pratyekabuddhas, arhats, and all those [on the paths of] learning and no-more-learning.

source: ཚངས་པ་དང་བཅས་པ་དང་། དགེ་སྦྱོང་དང་བཅས་བྲམ་ཟེར་བཅས་པའི་སྐྱེ་དགུ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པས་ཀྱང་དགོངས་ཤིང་ཡིད་དུ་འོང་བར་བྱ་བ་ཡིན།
en: They will be kept in mind and held dear by the world with its gods, demons, and Brahmā deities, as well as by [superior] human beings including virtuous ascetics and brāhmin priests, and by gods, humans, and asuras.

source: སྤོབས་པ་མི་འཕྲོགས་པར་འགྱུར་བ་ཡིན།
en: Their inspired speech will not be usurped.

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་མི་འཕྲོགས་པར་འགྱུར་བ་ཡིན།
en: Their perfection of generosity will not be usurped.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Their perfection of ethical discipline, perfection of tolerance, {Ki.

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མི་འཕྲོགས་པར་འགྱུར་བ་ཡིན།
en: II-III: 83} perfection of perseverance, perfection of meditative concentration, and perfection of wisdom will not be usurped.

source: ནང་སྟོང་པ་ཉིད་བསྒོམ་པ་མི་འཕྲོགས་པར་འགྱུར་བ་ཡིན། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་བསྒོམ་པ་མི་འཕྲོགས་པར་འགྱུར་བ་ཡིན།
en: Their cultivation of the emptiness of internal phenomena will not be usurped, and their cultivations of [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, will not be usurped.

source: དྲན་པ་ཉེ་བར་གཞག་པ་བསྒོམ་པ་མི་འཕྲོགས་པར་འགྱུར་བ་ཡིན། ཡང་དག་པར་སྤོང་བ་དང་།
en: Their cultivation of the applications of mindfulness will not be usurped.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་བསྒོམ་པ་མི་འཕྲོགས་པར་འགྱུར་བ་ཡིན། འཕགས་པའི་བདེན་པ་བཞི་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་།
en: Their cultivation of the correct exertions, the supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, and the noble eightfold path will not be usurped.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་བསྒོམ་པ་མི་འཕྲོགས་པར་འགྱུར་བ་ཡིན།
en: Their cultivation of the four truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the three gateways to liberation, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, [great loving kindness], great compassion, and the eighteen distinct qualities of the buddhas will not be usurped.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་མི་འཕྲོགས་པ་དང་།
en: Their acts that bring beings to maturation will not be usurped.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བ་མི་འཕྲོགས་པ་དང་།
en: Their acts that refine the buddhafields will not be usurped.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་བསྒོམ་པ་མི་འཕྲོགས་པར་འགྱུར་བ་ཡིན།
en: Their cultivation of all-aspect omniscience will not be usurped.

source: གཞན་གྱིས་ཕྱིར་བརྒལ་བ་ཇི་སྙེད་བྱུང་བ་ལ་ཡང་ཆོས་དང་མཐུན་པར་ལན་གདབ་པའི་མཐུ་ཡོད་པ་ཡིན་ཏེ། ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་ཅིང་།
en: They will have the power to answer in accordance with the Dharma all heretical repudiations that others might raise. “

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དང་ཡང་མ་བྲལ་བར་བྱེད་པ་དང་། བྲིས་ཤིང་དེ་ལ་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བྱེད་པ་དང་། བཀུར་སྟིར་བྱེད་པ་དང་། བསྟི་སྟང་དུ་བྱེད་པ་དང་།
en: Kauśika, those noble sons or noble daughters who take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom, never separating from the mind set on all-aspect omniscience, and who commit it to writing, and then serve, respect, honor, and worship it with various flowers, garlands, incense, unguents, powders, religious robes, clothing, parasols, victory banners, ribbons, and musical sounds, will accrue such qualities that pertain to this life. “

source: མཆོད་པར་བྱེད་པ་དེས་ཚེ་འདིའི་ཡོན་ཏན་འདི་དག་ཀྱང་ཡོངས་སུ་ཟིན་པར་འགྱུར་རོ། །ཀཽ་ཤི་ཀ་གཞན་ཡང་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བྲིས་ཤིང་གླེགས་བམ་དུ་བྱས་ཏེ་འཆང་བ་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷའི་བུ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ་དང་། སུམ་ཅུ་རྩ་གསུམ་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། ཚངས་རིས་དང་། ཚངས་ལྷ་ཉེ་ཕན་དང་། ཚངས་པ་ཀུན་འཁོར་དང་། ཚངས་ཆེན་དང་། སྣང་བ་དང་། ཆུང་སྣང་དང་། ཚད་མེད་སྣང་བ་དང་། ཀུན་སྣང་དང་བ་དང་། དགེ་བ་དང་། ཆུང་དགེ་དང་། ཚད་མེད་དགེ་བ་དང་།
en: Moreover, Kauśika, when any noble sons or noble daughters commit this perfection of wisdom to writing and retain it, the gods of the Caturmahā­rāja­kāyika realm throughout the world systems of the great trichiliocosm who have actually entered upon unsurpassed, complete enlightenment, and all the gods of Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, Para­nirmita­vaśa­vartin, Brahmakāyika, Brahmapurohita, Brahma­pariṣadya, Mahābrahmā, Ābha, Parīttābha, Apramāṇābha, Ābhāsvara, Śubha, Parīttaśubha, Apramāṇaśubha, Śubhakṛtsna, Bṛhat, Parīttabṛhat, Apramāṇabṛhat, and Bṛhatphala realms who have actually entered upon unsurpassed, complete enlightenment, will arrive there, and they will recite, uphold, master, pay homage to, and bow before this perfection of wisdom, and only then will they consider departing again [for their own abodes]. {

source: དགེ་རྒྱས་དང་། ཆེ་བ་དང་། ཆུང་ཆེ་བ་དང་། ཚད་མེད་ཆེ་བ་དང་། འབྲས་བུ་ཆེ་བའི་ལྷ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ་དེ་དག་ཀྱང་དེར་དོང་ཞིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཀླག་པ་དང་། གཟུང་བ་དང་། ཀུན་ཆུབ་པར་བྱ་བ་དང་། ཕྱག་བྱ་བ་དང་། གདུད་པ་བྱས་ཤིང་། ཕྱིར་འདོང་བར་སེམས་སོ། །གནས་གཙང་མའི་རིས་མི་ཆེ་བ་དང་། མི་གདུང་བ་དང་། ཤིན་དུ་མཐོང་བ་དང་། གྱ་ནོམ་སྣང་བ་དང་།
en: Ki.

source: འོག་མིན་གྱི་ལྷའི་བུ་དེ་དག་ཀྱང་དེར་དོང་ཞིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཀླག་པ་དང་། གཟུང་བ་དང་། ཀུན་ཆུབ་པར་བྱ་བ་དང་། ཕྱག་བྱ་བ་དང་། གདུང་བ་བྱས་ཤིང་ཕྱིར་འདོང་བར་སེམས་སོ།
en: II-III: 84} The gods of the Pure Abodes, namely those of the Avṛha, Atapa, Sudṛśa, Sudarśana, and Akaniṣṭha realms, also will arrive there, and they will recite, uphold, master, pay homage to, and bow before this perfection of wisdom, and only then will they consider departing again [for their own abodes]. “

source: །ཀཽ་ཤི་ཀ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷའི་བུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ་དང་། སུམ་ཅུ་རྩ་གསུམ་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། ཚངས་རིས་ཀྱི་ལྷ་དང་། ཚངས་ལྷ་ཉེ་ཕན་དང་། ཚངས་པ་ཀུན་འཁོར་དང་། ཚངས་ཆེན་དང་། སྣང་བ་དང་། ཆུང་སྣང་དང་། ཚད་མེད་སྣང་བ་དང་། ཀུན་སྣང་དང་བ་དང་། དགེ་བ་དང་། ཆུང་དགེ་དང་། ཚད་མེད་དགེ་བ་དང་། དགེ་རྒྱས་དང་། ཆེ་བ་དང་། ཆུང་ཆེ་དང་། ཚད་མེད་ཆེ་བ་དང་། འབྲས་བུ་ཆེ་བའི་ལྷའི་བུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ་དང་། གནས་གཙང་མའི་རིས་མི་ཆེ་བ་དང་། མི་གདུང་བ་དང་། ཤིན་ཏུ་མཐོང་བ་དང་། གྱ་ནོམ་སྣང་བ་དང་། འོག་མིན་གྱི་ལྷ་དང་། དེ་མ་ཡིན་པའི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་གཟི་བརྗིད་ཆེན་པོ་གཟི་བརྗིད་ཆེ་བར་བྱ་བ་མང་པོ་དེ་དག་ཀྱང་དེར་དོང་ཞིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཀླག་པ་དང་། གཟུང་བ་དང་། ཀུན་ཆུབ་པར་བྱ་བ་དང་ཕྱག་བྱ་བ་དང་།
en: Kauśika, the gods of the Caturmahā­rāja­kāyika realm throughout the world systems of the ten directions who have actually entered upon unsurpassed, complete enlightenment; and all the gods of Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, Para­nirmita­vaśa­vartin, Brahmakāyika, Brahmapurohita, Brahma­pariṣadya, Mahābrahmā, Ābha, Parīttābha, Apramāṇābha, Ābhāsvara, Śubha, Parīttaśubha, Apramāṇaśubha, Śubhakṛtsna, Bṛhat, Parīttabṛhat, Apramāṇabṛhat, and Bṛhatphala realms who have actually entered upon unsurpassed, complete enlightenment; and the gods of the Pure Abodes, namely those of the Avṛha, Atapa, Sudṛśa, Sudarśana, and Akaniṣṭha realms, will also arrive there, along with many gods other than those, and nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas who are said to be of great majesty and great splendor, and they will recite, uphold, master, pay homage to, and bow before this the perfection of wisdom.

source: གདུད་པ་བྱས་ཤིང་ཕྱིར་འདོང་བར་སེམས་སོ། །ཀཽ་ཤི་ཀ་དེ་ལ་རིགས་ཀྱི་བུའམ།
en: Only then will they consider departing again [for their own abodes]. “

source: རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་ཀྱང་སེམས་འདི་ལྟར་བསྐྱེད་པར་བྱ་སྟེ། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་དང་། འབྲས་བུ་ཆེ་བའི་བར་གྱི་ལྷ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ་དང་། གནས་གཙང་མའི་རིས་མི་ཆེ་བ་དང་། མི་གདུང་བ་དང་། ཤིན་དུ་མཐོང་བ་དང་། གྱ་ནོམ་སྣང་བ་དང་། འོག་མིན་གྱི་བར་གྱི་ལྷ་དང་། དེ་མ་ཡིན་པའི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་།
en: Kauśika, those noble sons or noble daughters should also think, ‘May I grant this gift of the Dharma to the gods of the Caturmahā­rāja­kāyika realm throughout the world systems of the ten directions, and to the gods of other realms, up to and including Bṛhatphala, who have actually entered upon unsurpassed, complete enlightenment; and to the gods of the Pure Abodes, namely those of the Avṛha, Atapa, Sudṛśa, Sudarśana, and Akaniṣṭha realms; as well as to the gods other than those; and to nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas who are of great splendor, who have all arrived in order to recite, uphold, master, pay homage to, and worship this.

source: མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་གཟི་བརྗིད་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཀླག་པ་དང་། གཟུང་བ་དང་། ཀུན་ཆུབ་པར་བྱ་བ་དང་། ཕྱག་བྱ་བ་དང་། མཆོད་པ་བྱ་བའི་ཕྱིར་ལྷགས་པ་དེ་དག་ལ་ཆོས་ཀྱི་སྦྱིན་པ་འདི་བྱིན་པར་གྱུར་ཅིག་ཅེས་སེམས་བསྐྱེད་པར་བྱ་སྟེ།
en: perfection of wisdom!’

source: དེ་དག་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཀླགས་པ་དང་། བཟུང་བ་དང་། བཅངས་པ་དང་། ཀུན་ཆུབ་པར་བྱ་བ་དང་། མཆོད་པ་བྱས་ཤིང་། ཕྱག་བྱས་ཏེ། གདུད་པ་བྱས་ནས་ཕྱིར་འདོང་ངོ་། །ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུ་འམ།
en: Once they have indeed recited, upheld, mastered, paid homage to, made offerings to, and bowed before this perfection of wisdom, they will depart again [for their own abodes]. “

source: རིགས་ཀྱི་བུ་མོ་དེ་ལ། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་དང་། འོག་མིན་གྱི་བར་གྱི་ལྷ་དག་དང་། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་དང་། འོག་མིན་གྱི་བར་གྱི་ལྷ་དེ་དག་ཀྱང་བསྲུང་བ་དང་།
en: Kauśika, the gods present in the world systems of this great trichiliocosm, extending from the Caturmahā­rāja­kāyika realm as far as Akaniṣṭha, and the gods present in the world systems of the ten directions, extending from the Caturmahā­rāja­kāyika realm as far as Akaniṣṭha, will guard, protect, and nurture those noble sons or noble daughters. “

source: བསྐྱབ་པ་དང་། བསྐྱང་བ་བྱེད་དེ། ཀཽ་ཤི་ཀ་དེ་ལ་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མ་གཏོགས་པར། གླགས་ལྟ་བ་རྣམས་ཀྱིས་གླགས་མི་རྙེད་དོ།
en: Kauśika, anyone seeking to censure those [noble sons or noble daughters] would find no opportunity to do so, except in connection with the ripening of past actions.

source: །ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དེས་ཚེ་འདིའི་ཡོན་ཏན་དེ་ལྟ་བུ་དག་ཀྱང་། ཡོངས་སུ་ཟིན་པར་འགྱུར་རོ།
en: Kauśika, those noble sons or noble daughters will accrue such qualities pertaining to this life.

source: །ལྷའི་བུ་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ་དེ་དག་ཀྱང་། དེར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་མཆོད་པ་བྱ་བ་དང་། རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་དེ་དག་ལ་བསྲུང་བ་དང་། བསྐྱབ་པ་དང་།
en: Gods who have actually entered upon unsurpassed, complete enlightenment will indeed decide to come there in order to worship this perfection of wisdom and in order to guard, protect, and nurture those noble sons or noble daughters.

source: བསྐྱང་བ་བྱ་བའི་དོན་དུ་འདོང་བར་སེམས་ཏེ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ་སྟེ།
en: If you ask why, Kauśika, it is because those noble sons or noble daughters have actually entered upon unsurpassed, complete enlightenment.

source: སེམས་ཅན་ཐམས་ཅད་བསྐྱབ་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། བདེ་བའི་དོན་དུ་ཉེ་བར་གནས་པའི་ཕྱིར་རོ། །བརྒྱ་བྱིན་གྱིས་གསོལ་བ།
en: They protect all beings, they bring all beings to maturation, they benefit all beings, and they secure all beings in happiness.”

source: བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེས་འདིར་ཕྱོགས་བཅུ་ཀུན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་ནས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཀླག་པ་དང་། བཟུང་བ་དང་། བཅང་བ་དང་། ཀུན་ཆུབ་པར་བྱ་བ་དང་། ཕྱག་བྱ་བ་དང་། གདུང་བ་དང་། རིམ་གྲོར་བྱ་བ་དང་། བཀུར་སྟིར་བྱ་བ་དང་། བསྟི་སྟང་དུ་བྱ་བ་དང་། མཆོད་པའི་ཕྱིར་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་དང་། འོག་མིན་གྱི་བར་གྱི་ལྷ་དག་འདིར་འོངས་སོ་ཞེས་བགྱི་བར་ཇི་ལྟར་འཚལ་བར་འགྱུར།
en: Śakra then asked, “Blessed Lord, how will those noble sons or noble daughters know that the gods of the Caturmahā­rāja­kāyika realm and the gods [of other realms], up to and including Akaniṣṭha, will have arrived here from the world systems of the ten directions in order to recite, uphold, retain, master, pay homage to, bow before, serve, respect, honor, and worship this perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་གལ་ཏེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་གང་དུ་གཞག་པར་སྣང་བ་ཆེན་པོ་བྱུང་བར་རིགས་ཀྱི་བུའམ།
en: Kauśika,” replied the Blessed One, {Ki.
